tap "homebrew/bundle"
tap "oven-sh/bun"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Command-line note taker
brew "jrnl"
# Modern and intuitive terminal-based text editor
brew "micro"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# GPU-accelerated terminal emulator
cask "alacritty"
# Desktop client for GitHub repositories
cask "github"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Open-source code editor
cask "visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "fabiospampinato.vscode-install-vsix"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "leodevbro.blockman"
vscode "mrmlnc.vscode-json5"
vscode "oven.bun-vscode"
vscode "sinedied.vscode-windows-xp-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "taichi.vscode-textlint"
vscode "tamasfe.even-better-toml"
vscode "uloco.theme-bluloco-dark-corrected"
vscode "unifiedjs.vscode-mdx"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-icons-mac"
